examples/yeast_radially_symmetric/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object fvSchemes;
}

    ddtSchemes
    {
	default CrankNicolson 0.9;
    }

    gradSchemes
    {
        default Gauss linear;
    }

    divSchemes
    {
        default Gauss linear;
    }

    interpolationSchemes
    {
        default linear;
    }

    laplacianSchemes
    {
        default Gauss linear corrected;
    }

    snGradSchemes
    {
        default corrected;
    }

    fluxRequired
    {
        default yes;
        p ;
        Phi ;
    }
