examples/yeast_radially_symmetric/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object fvSolution;
}

    SIMPLE
    {
        nNonOrthogonalCorrectors 3;
        pRefCell 0;
        pRefValue 0;
        residualControl
        {
            U 1.0E-3;
            p_rgh 1.0E-3;
	    c 0; // This way it never stops...only when we tell it to
        }

    }

    solvers
    {
	p_rgh
	{
            solver GAMG;
            agglomerator faceAreaPair;
            mergeLevels 1;
            cacheAgglomeration true;
            nCellsInCoarsestLevel 200;
            tolerance 1e-7;
            relTol 0.01;
            smoother GaussSeidel;
            nPreSweeps 0;
            nPostSweeps 2;
            nFinestSweeps 2;
            minIter 1;
	}

        U
        {
            solver smoothSolver;
            smoother GaussSeidel;
            tolerance 1e-6;
            relTol 0.1;
            minIter 1;
        }

	c
	{
	    solver          PBiCG;
	    preconditioner  DILU;
	    tolerance       1e-06;
	    relTol          0;
	}


    }

    relaxationFactors
    {
        fields
        {
            p_rgh 0.3;
        }

        equations
        {
            U 0.7;
	    c 0.7;
        }

    }
